---
type: RebarShapeSegment
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 4
tags: [revit-api, class]
---

# RebarShapeSegment

`Autodesk.Revit.DB.Structure.RebarShapeSegment` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetConstraints | 2012 | `public IList < RebarShapeConstraint > GetConstraints ()` |
| Method | SetConstraints | 2012 | `public void SetConstraints ( IList < RebarShapeConstraint > constraints )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |